#Вариант22 Залание 1
#Дано вещественное число X (|X|<1) и целое число N (>0). Найти значение выражения
#X - X^3/3 + X^5/5 - ... (-1)^N*X^(2N+1)/(2N+1). Полученное число является
#приближенным значением функции arctg в точке X

con = 0.0
x = input("Введите число X: ")
n = input("Введите число N: ")
while type(x) != float:
    try:
        x = float(x)
    except ValueError:
        print("Вы ввели не число!")
        x = input("Введите число X: ")

while type(n) != int:
    try:
        n = int(n)
    except ValueError:
        print("Вы ввели не число!")
        n = input("Введите число N: ")

# Вычисление приближенного значения arctg(x)
for i in range(n + 1):
    a = ((-1) ** i) * (x ** (2 * i + 1)) / (2 * i + 1)
    con += a

print(f"Полученное значение выражения: ", con)