#Вариант 22 #Задание 2
#Дано число A (>1). Вывести наибольшее из целых чисел K, для которых сумма
#1 + 1/2 + ... 1/K будет меньше A, и саму эту сумму.

sum = 0
k = 0
a = input("Введите число A: ")
while type(a) != int:
    try:
        a = int(a)
    except ValueError:
        print("Вы ввели не число!")
        a = input("Введите число A: ")

while sum + 1 / (k + 1) < a: #Цикл выполняется пока сумма + 1/(k+1) меньше а
    k += 1
    sum += 1 / k

print(f"Наибольшее число K: ", k)
print(f"Полученная сумма: ", sum)
