#Вывести первые N (N>=3) чисел Фибоначчи и посчитать количество четных чисел.

con = 0

a = int(input("Введите первое число для прогрессии Фибоначчи: "))
b = int(input("Введите второе число для прогрессии Фибоначчи: "))
n = int(input("Введите количество элементов прогрессии: "))

while n < 3:
    print("Количество элементов должно быть больше или равно 3")
    n = int(input("Введите количество элементов прогрессии: "))
print("Последовательность Фибоначчи с данными величинами: ")
print(a)
print(b)
for i in range(n):
    c = a + b
    print(c)
    if c % 2 == 0:
        con += 1
    a = b
    b = c
print(f"Количество четных чисел в последовательности: {con}")