#Даны два целых числа A и B (A < B). Вывести в порядке убывания все целые числа,
#расположенные между A и B (включая сами числа A и B), а также количество
#этих чисел (использовать оператор цикла)

con = 0

a = float(input("Введите число A: "))
b = float(input("Введите число B: "))
while a > b:
    print("Число A должно быть меньше B")
    a = float(input("Введите число A: "))
    b = float(input("Введите число B: "))


print("Числа в порядке убывания:")
for i in range(int(b), int(a) - 1, -1):
    con += 1
    print(i)

print(f"\nКоличество чисел: {con}")