#Посчитать и вывести количество элементов арифметической прогрессии,
#удовлетворяющих условию 10<ai<30

con = 0

a = float(input("Введите первый член прогрессии: "))
b = float(input("Введите разность прогрессии: "))
n = int(input("Введите количество элементов прогрессии: "))

while n <= 0:
    print("Количество элементов должно быть больше 0!")
    n = int(input("Введите количество элементов прогрессии: "))

print("\nЭлементы прогрессии:")
for i in range(n):
    c = a + i * b #Находим элемент прогрессии
    print(c)
    if 10 < c < 30: #Проверяем условие
         con += 1

print(f"\nКоличество элементов в диапазоне от 10 до 30 : {con}")

