#Ввести 4 числа. Найти и вывести на экран сумму и количество отрицательных чисел

con = 0
sm = 0
bob = 0
a = int(input("Введите 1 число: "))
b = int(input("Введите 2 число: "))
c = int(input("Введите 3 число: "))
d = int(input("Введите 4 число: "))

for i in [a,b,c,d]:
    if i < 0:
        sm += i
        con += 1
    if i >= 0:
        bob += 1

if bob == 4:
    print("В ряду нет отрицательных чисел")
else:
    print("Количество отрицательных чисел: ", con)
    print("Сумма отрицательных чисел: ", sm)