#Вариант22 Задание2
#Даны два числа. Вывести большее из них.

a = input("Введите первое число: ")
b = input("Введите второе число: ")
while type(a) != int or type(b) != int:
        try:
            a = int(a)
            b = int(b)
        except ValueError:
            print("Вы ввели неправильные данные:")
            a = input("Введите первое число: ")
            b = input("Введите второе число: ")

print("Максимальное число: ", max(a,b))

#Альтернативное решение:
if a > b:
    print("Максимальное число: ", a)
elif a < b:
    print("Максимальное число: ", b)
else:
    print("Числа равны")
