#Ввести двухзначное число. Если сумма цифр числа четная, то увеличить число на 2
#в противном случае уменьшить его на 2

x = input("Введите двухзначное число: ")

while type(x) != int:
    try:
        x = int(x)
    except ValueError:
        print("Вы ввели не число!")
        x = input("Введите двухзначное число: ")

while x<=9 or x>=100:
    print("Это не двухзначное число!")
    x = int(input("Введите двухзначное число: "))

#Находим цифры числа
a = x%10
b = x//10
if (a+b)%2 == 0:
    print("Сумма цифр числа четная, увеличиваем сумму на 2: ", (a+b)*2)
else:
    print("Сумма цифр числа не четная, уменьшаем сумму на 2: ", (a+b)/2)
