#Дано два числа. Если их сумма кратка 5, то прибавь 1, иначе вычесть 2.

a = input("Введите первое число: ")
b = input("Введите второе число: ")
while type(a) != int or type(b) != int:
        try:
            a = int(a)
            b = int(b)
        except ValueError:
            print("Вы ввели неправильные данные:")
            a = input("Введите первое число: ")
            b = input("Введите второе число: ")
if (a + b)% 5 == 0:
    print("Сумма чисел кратка 5, прибавляем 1:", a+b+1)
else:
    print("Сумма чисел не кратка 5, отнимаем 2:", a+b-2)