#Вариант 23. Дано целое число, больше 999. Используя одну операцию деления нацело и одну операцию взятия остатка от деления,
# найти цифру, соответсвующую разряду тысяч в записиси этого числа.

x = input("Введите четырехзначное число: ")
while type(x) != int:
    try:
        x = int(x)
    except ValueError:
        print("Вы ввели не число!")
        x = input("Введите четырехзначное число: ")
while x<=999:
    print("Число меньше 999, введите число больше 999!")
    x = input("Введите четырехзначное число: ")

print((x//1000)%10)


