#Вариант22 Задание1
#Дано трехзначное число. Проверить истинность высказывания "Цифры данного числа
# образуют возрастающую последовательность"

x = input("Введите трёхзначное число: ")
while type(x) != int:
    try:
        x = int(x)
    except ValueError:
        print("Вы ввели не число!")
        x = input("Введите трёхзначное число: ")
while x<=99 or x>=1000:
    print("Это не трехзначное число!")
    x = int(input("Введите трёхзначное число: "))

#Находим по отдельности цифры числа x
a = x//100
b = (x//10)%10
c = x%10
if a<b<c:
    print("Цифры в числе возрастают.")
else:
    print("Цифры в числе не возрастают")