#Ввести 2 числа. Если их произведение отрицательно, умножить его на 8, в противном случае
#увеличить его в 1.5 раза

a = input("Введите первое число: ")
b = input("Введите второе число: ")
while type(a) != int or type(b) != int:
        try:
            a = int(a)
            b = int(b)
        except ValueError:
            print("Вы ввели неправильные данные:")
            a = input("Введите первое число: ")
            b = input("Введите второе число: ")
if (a * b) < 0:
    print("Произведение отрицательно, умножаем его на 8:", (a * b * 8))
else:
    print("Произведение положительно или равно 0, умножаем его на 1.5:", (a * b * 1.5))